

"""

春节假期加餐 - 类和对象 - 进阶练习 - (挑战题，逻辑思维练习 ，不讲解，提供参考答案)（选做）
1、创建员工类Employee，属性有姓名name、能力值ability、年龄age（能力值为100-年龄），

功能有doWork（），该方法执行一次，该员工的能力值-5，

创建str方法，打印该员工的信息



2、创建老板类Boss，属性有金钱money,员工列表employeeList（存储员工类对象），工作量work,

功能有雇佣员工addEmployee()，雇佣后将员工添加至列表中，雇佣一人money减5000，金额不足时不能雇佣新员工；

开始工作startWork(),工作开始后，依次取出员工列表中的员工开始工作，员工能力值减少的同时总的工作量work也减少，

当工作量work为0时，工作结束，调用endWork（该方法为Boss类方法，打印员工的能力值信息）方法，

如果所有员工使用完后，依然没有完成工作，则提示老板需要雇佣新员工，并打印剩余工作量



3、创建Boss类对象(金钱和工作量，自行定义和传参)，默认执行雇佣3个员工，年龄分别为30,40,50，然后死循环开始工作，直至工作完成。



ps:

  1、涉及到的逻辑处理，建议同学们画流程图。画好流程图，再考虑怎么写代码。

  2、自己先手动一步步实现。锻炼一下自己的逻辑思维处理能力。

  3、不管对与错，先尝试，再调整。



加油，骚年们，你们是最棒的！！！

"""

